<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Muse and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bytefloater.munki.Muse</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Muse</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Muse Helper (Plugin).app</string>
				<string>Muse.app</string>
				<string>Muse Helper.app</string>
				<string>Muse Helper (GPU).app</string>
				<string>Muse Helper (Renderer).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Muse App LLC</string>
			<key>display_name</key>
			<string>Muse</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
			rm -rf /Library/Muse
			rm -rf /Applications/Muse.app
			rm -rf /Library/Audio/Plug-Ins/HAL/MuseAudioShare.driver
			rm -rf /Library/Audio/Plug-Ins/HAL/MuseRecording.driver
			rm -rf /Library/Audio/Plug-Ins/HAL/MuseDAWBridge.driver
			rm -rf /Library/Audio/Plug-Ins/HAL/muse_audio_drivers_ver
			rm -rf /Library/Audio/Plug-Ins/Components/MusePlugin.component
			rm -rf /Library/Audio/Plug-Ins/VST3/MusePlugin.vst3
			rm -rf ~/'Library/Application Support/muse-app'
			launchctl kickstart -kp system/com.apple.audio.coreaudiod
			exit $?
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bytefloater.download.Muse</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
